app/Controllers/AuthController.php

    public function register() {
        $json = $this->request->getJSON(true); // ← convierte JSON a array asociativo

        if (!$json) {
            return $this->fail('No se recibió JSON válido', 400);
        }

        // Validar datos
        $rules = [
            'nombre' => 'required|min_length[3]',
            'email' => 'required|valid_email|is_unique[usuarios.email]',
            'password' => 'required|min_length[6]'
        ];

        if (!$this->validateData($json, $rules)) {
            return $this->fail($this->validator->getErrors());
        }

        // Guardar usuario
        $model = new UsuarioModel();
        $data = [
            'nombre'   => $json['nombre'],
            'apellido' => $json['apellido'],
            'email'    => $json['email'],
            'password' => password_hash($json['password'], PASSWORD_DEFAULT)
        ];

        $model->save($data);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `email`, `password`, `created_at`, `updated_at`) VALUES ('Juan', 'Pérez', 'juanperez@example.com', '$2y$10$j43O.zoh3bqxuwaociaDn.KiHXk7T2QcLD2vYuwM5L/TJZSRV/iOC', '2025-05-20 10:28:51', '2025-05-20 10:28:51')